Revit 2027 API
SpatialFieldManager.NumberOfMeasurements Property
 Stores the total number of measurements
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfMeasurements { get; }
Public ReadOnly Property NumberOfMeasurements As Integer
	Get
public:
property int NumberOfMeasurements {
	int get ();
}
member NumberOfMeasurements : int with get
Property Value
Int32
Remarks
 This number defines the length of value arrays in ValueAtPoint objects
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace